src/Documents/Scan_ЗакреплениеМенеджеровЗаДилерами/Scan_ЗакреплениеМенеджеровЗаДилерами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Scan_ЗакреплениеМенеджеровЗаДилерами</name>
  <comment>Документ необходим для учета ответственных менеджеров за дилерами, определенных распоряжением по компании</comment>
  <registerRecords>InformationRegister.Scan_ЗакреплениеМенеджеровЗаДилерами</registerRecords>
  <attributes>
    <name>ДатаРаспоряжения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерРаспоряжения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписантВПФ</name>
    <type>
      <types>CatalogRef.Scan_Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтветственныеМенеджеры</name>
    <attributes>
      <name>Дилер</name>
      <type>
        <types>CatalogRef.Scan_Компании</types>
      </type>
    </attributes>
    <attributes>
      <name>Менеджер</name>
      <type>
        <types>CatalogRef.Scan_Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/Scan_ЗакреплениеМенеджеровЗаДилерами/Scan_ЗакреплениеМенеджеровЗаДилерами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ЗакреплениеМенеджеровЗаДилерами</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Scan_Сотрудники</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Дилер</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/Scan_Компании/Scan_Компании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_Компании</name>
  <predefined>
    <items>
      <name>СканияРусь</name>
      <description>Скания Русь</description>
    </items>
  </predefined>
  <attributes>
    <name>DealerID_COW</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDExternalSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДилера</name>
    <type>
      <types>EnumRef.Scan_ВидыДилеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыКомпаний</name>
    <type>
      <types>CatalogRef.Scan_ГруппыКомпаний</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Дилер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДилерАктивен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодДилера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодДилераSOWA</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеАнглийское</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетныйСклад</name>
    <type>
      <types>CatalogRef.Scan_МестаХранения</types>
      <types>CatalogRef.Scan_Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусыКомпаний</name>
    <type>
      <types>CatalogRef.Scan_СтатусыКомпаний</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипыДилеров</name>
    <type>
      <types>CatalogRef.Scan_ТипыДилеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормыКомпаний</name>
    <type>
      <types>CatalogRef.Scan_ФормыКомпаний</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РегионыОтветственности</name>
    <attributes>
      <name>Регион</name>
      <type>
        <types>CatalogRef.Scan_Регионы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоступныеМаркиДилера</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Марка</name>
      <type>
        <types>CatalogRef.Scan_МаркиПродуктов</types>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Documents/Scan_ЗакреплениеМенеджеровЗаДилерами/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для каждого ТекСтрока из ОтветственныеМенеджеры Цикл
		Если не ЗначениеЗаполнено(ТекСтрока.Дилер) Тогда
			ВывестиСообщениеПол(Нстр("ru = 'Не заполнено поле ""Дилер""'; en = 'Не заполнено поле ""Дилер""'"),ЭтотОбъект,"ОтветственныеМенеджеры[#].Дилер",ТекСтрока.НомерСтроки);
			Отказ = истина;
		КонецЕсли;
		Если не ЗначениеЗаполнено(ТекСтрока.Менеджер) Тогда
			ВывестиСообщениеПол(Нстр("ru = 'Не заполнено поле ""Менеджер""'; en = 'Не заполнено поле ""Менеджер""'"),ЭтотОбъект,"ОтветственныеМенеджеры[#].Менеджер",ТекСтрока.НомерСтроки);
			Отказ = истина;
		КонецЕсли;
		Если (текстрока.Дилер = Справочники.Scan_Компании.СканияРусь) и (ТекСтрока.Менеджер.МенеджерСканияРусь = ложь) Тогда
			ВывестиСообщениеПол(Нстр("ru = 'Для дилера ""Скания Русь"" указан сотрудник без признака ""менеджер Скания-Русь""'; en = 'Для дилера ""Скания Русь"" указан сотрудник без признака ""менеджер Скания-Русь""'"),ЭтотОбъект,"ОтветственныеМенеджеры[#].Менеджер",ТекСтрока.НомерСтроки);
			Отказ = истина;
		Конецесли;			
		
	КонецЦикла;
	КопияОтветственных = ОтветственныеМенеджеры.Выгрузить();
	КоличествоОбщее = КопияОтветственных.Количество();
	КопияОтветственных.Свернуть("Дилер");
	КоличествоСгруппированных = КопияОтветственных.Количество();
	Если не КоличествоОбщее = КоличествоСгруппированных ТОгда
		
		ВывестиСообщениеПол(Нстр("ru = 'Есть дубли дилеров'; en = 'Есть дубли дилеров'"),ЭтотОбъект,"ОтветственныеМенеджеры");
			Отказ = истина;	
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//rarus vikhle 28.02.2022 m 18879 +++
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		ДанныеSetAdditionalProperty = Scan_ВспомогательныеФункцииСервер.ПолучитьДанныеSetAdditionalProperty(ЭтотОбъект);
		ДополнительныеСвойства.Вставить("ДанныеSetAdditionalProperty", ДанныеSetAdditionalProperty);	
		
	КонецЕсли;	
		
	Scan_ВспомогательныеФункцииСервер.ПроверитьМенеджеровДокументаЗакрепления(ЭтотОбъект, Отказ);
	//rarus vikhle 28.02.2022 m 18879 ---
	 
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Scan_ЗакреплениеМенеджеровЗаДилерамиОтветственныеМенеджеры.Ссылка.ДатаРаспоряжения КАК Период,
		|	Scan_ЗакреплениеМенеджеровЗаДилерамиОтветственныеМенеджеры.НомерСтроки КАК НомерСтроки,
		|	Scan_ЗакреплениеМенеджеровЗаДилерамиОтветственныеМенеджеры.Дилер КАК Дилер,
		|	Scan_ЗакреплениеМенеджеровЗаДилерамиОтветственныеМенеджеры.Менеджер КАК Менеджер,
		|	Scan_ЗакреплениеМенеджеровЗаДилерамиОтветственныеМенеджеры.Ссылка.Менеджер КАК Пользователь,
		|	Scan_ЗакреплениеМенеджеровЗаДилерамиОтветственныеМенеджеры.Ссылка КАК Регистратор
		|ИЗ
		|	Документ.Scan_ЗакреплениеМенеджеровЗаДилерами.ОтветственныеМенеджеры КАК Scan_ЗакреплениеМенеджеровЗаДилерамиОтветственныеМенеджеры
		|ГДЕ
		|	Scan_ЗакреплениеМенеджеровЗаДилерамиОтветственныеМенеджеры.Ссылка = &Ссылка";
	//rarus vikhle 30.09.2020 mt 16573 заменил в запросе автора на менеджера для пользователя
	
	Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
		
	Движения.Scan_ЗакреплениеМенеджеровЗаДилерами.Загрузить(Запрос.Выполнить().Выгрузить());	
	
	Движения.Scan_ЗакреплениеМенеджеровЗаДилерами.Записать();
	
	// rarus vikhle 01.03.20 22 m 18879 +++
	Если ДополнительныеСвойства.Свойство("ДанныеSetAdditionalProperty") Тогда
		
		Scan_ВспомогательныеФункцииСервер.ОтправитьЗакрепленныхМенеджеровВ1БД(ДополнительныеСвойства.ДанныеSetAdditionalProperty,
							Справочники.Scan_ДополнительныеРеквизиты1БД.РегиональныйМенеджерОП.ИмяПредопределенныхДанных);
							
	КонецЕсли;	
	// rarus vikhle 01.03.2022 m 18879 ---
	
КонецПроцедуры
